// 一些浮点型修饰符的组合
#include <stdio.h>

int main(void)
{
    const double RENT = 3852.99;  //const 变量

    printf("*%f*\n",RENT);      //系统默认格式，小数点后保留六位                                      *3852.990000*
    printf("*%e*\n",RENT);       //e指数格式                                                        *3.852990e+003*
    printf("*%4.2f*\n",RENT);   //总字段宽度为4（如果不够会自动扩大），小数点后保留两位                 *3852.99*
    printf("*%3.1f*\n",RENT);   //总字段宽度为3（如果不够会自动扩大），小数点后保留一位                 *3853.0*
    printf("*%10.3f*\n",RENT);  //总字段宽度为10，小数点后保留三位                                      *  3852.990*
    printf("*%-10.3f*\n",RENT); //总字段宽度为10，小数点后保留三位，左对齐                              *3852.990  *
    printf("*%10.3E*\n",RENT);  //总字段宽度为10，小数点后保留三位，E指数格式                           *3.853E+003*
    printf("*%+4.2f*\n",RENT);  //总字段宽度为4（如果不够会自动扩大），小数点后保留两位，显示正负        *+3852.99*
    printf("*%010.2f*\n",RENT); //总字段宽度为10，小数点后保留两位，且用0填充空字符                     *0003852.99*

    return 0;
}